---
kind: type
id: T:Autodesk.Revit.DB.HostObjectUtils
source: html/05539c78-f61a-4e75-0a8a-becb0a66b941.htm
---
# Autodesk.Revit.DB.HostObjectUtils

These are generic host object utilities.

## Syntax (C#)
```csharp
public static class HostObjectUtils
```